#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
  (async-shell-command "./copy.sh" "log" "err")
#+end_src

#+RESULTS:
: #<window 141 on log>

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./copy.sh
  cd "$(dirname -- "${0}")"
  cp -vf -- './wezterm.lua' "${HOME}/.wezterm.lua"
  exit '0'
#+end_src

#+begin_src conf :tangle ./wezterm.lua
  -- Pull in the wezterm API
  local wezterm = require 'wezterm'

  -- This will hold the configuration.
  local config = wezterm.config_builder()

  config.default_prog = { '/usr/local/bin/fish', '-l' }
  config.use_fancy_tab_bar = false

  config.keys = {
    {
      key = '/',
      mods = 'CTRL|ALT',
      action = wezterm.action.ShowLauncher ,
    },
  }

   
  config.launch_menu = {
    {
      label = 'fish',
      args = { '/usr/local/bin/fish', '-l' },
    },

    {
      label = 'Bash',
      args = { '/bin/bash', '-l' },
    },

    {
      label = 'tmux',
      args = { '/usr/local/bin/tmux_auto.sh' },
    },

    {
      label = 'top',
      args = { '/usr/local/bin/btm', '-b', '--process_command' },
    },

    {
      label = 'alsamixer',
      args = { 'alsamixer' },
    },
  }

  return config
#+end_src
